{"first_name": "Neal", "last_name": "Dunn", "party": "Republican", "state": "FL", "type": "rep", "twitter": "DrNealDunnFL2", "district": 2, "senate_class": 0, "facebook": "drnealdunnfl2", "website": "https://dunn.house.gov", "contact": null, "birthday": "1953-02-16", "serving_congress_since": "2017-01-03", "serving_current_chamber_since": "2017-01-03", "scorecard": {"blame": {"count": 986, "percent": 0.0538, "rank": 369.0, "sources": {"floor": {"count": 18, "percent": 0.0}, "newsletters": {"count": 796, "percent": 0.0364}, "statements": {"count": 148, "percent": 0.1351}, "tweets": {"count": 24, "percent": 0.1667}}, "example": {"date": "", "source": "newsletters", "text": "House Democrats cut out House Republicans every step of the way and delayed a final appropriations bill until after the election to hide their costly wish list items. They want to pass this bill at the eleventh hour while America sleeps, so they can ram through trillions of dollars in new reckless spending to fund their failed agenda."}}, "compromise": {"count": 989, "percent": 0.0152, "rank": 424.0, "sources": {"floor": {"count": 18, "percent": 0.0556}, "newsletters": {"count": 796, "percent": 0.0063}, "statements": {"count": 151, "percent": 0.0596}, "tweets": {"count": 24, "percent": 0.0}}, "example": {"date": "", "source": "floor", "text": "This bipartisan legislation provides a solution that works for everyone, and I encourage my colleagues to vote in favor of HR 1108."}}, "credit_claiming": {"count": 994, "percent": 0.0553, "rank": 421.0, "sources": {"floor": {"count": 18, "percent": 0.0556}, "newsletters": {"count": 796, "percent": 0.0377}, "statements": {"count": 156, "percent": 0.141}, "tweets": {"count": 24, "percent": 0.0833}}, "example": {"date": "", "source": "newsletters", "text": " News from Representative Dunn Click here to open this e-mail in its own browser window Click here to open a plain text version of this email Click here to forward this email Contact Issues Services About NEWS FROM THE SECOND DISTRICT Dear Friend, This past week, the House passed the National Defense Authorization Act of 2023. This bill contains several Republican wins - Includes a 4.6% pay raise for service members Additional $750 million to offset skyrocketing food and housing costs for service members and families Overturns Secretary Austin's order requiring active and reserve component servicemembers to take the COVID-19 vaccine Encourages DoD to reinstate and provide full veterans benefits to servicemembers separated for failing to take the COVID-19 vaccine Reinforces the rights of parents of children attending DoD schools to review curriculum, instructional materials, and disciplinary policies Prohibits the Secretary from modifying the scope of medical care at military medical treatment facilities without first notifying Congress Fully funds the National Guard's operation and maintenance account to support a border deployment and requires quarterly briefings to Congress on DOD support for DHS at the southwest border Authorizes DoD to reimburse military families for certain childcare expenses associated with servicemember change of station orders This package isn't perfect - it never is - but I'm proud to support our military with raises, assistance, and protections."}}, "insult": {"count": 986, "percent": 0.001, "rank": 384.5, "sources": {"floor": {"count": 18, "percent": 0.0}, "newsletters": {"count": 796, "percent": 0.0013}, "statements": {"count": 148, "percent": 0.0}, "tweets": {"count": 24, "percent": 0.0}}, "example": {"date": "", "source": "newsletters", "text": "Schiff led the modern-day witch hunt against President Trump, and former Speaker Pelosi and House Democrats strongly supported and encouraged this dangerous behavior. We cannot continue to let Adam Schiff get away with the damage he's done."}}, "policy": {"count": 994, "percent": 0.3421, "rank": 456.0, "sources": {"floor": {"count": 18, "percent": 0.9444}, "newsletters": {"count": 796, "percent": 0.2764}, "statements": {"count": 156, "percent": 0.609}, "tweets": {"count": 24, "percent": 0.3333}}, "example": {"date": "", "source": "tweets", "text": "Today is #FentanylAwarenessDay. Fentanyl overdoses are now the #1 cause of death among young adults nationwide. I’m grateful to [[user]] & #FL02 law enforcement for joining me last week to discuss the Fentanyl epidemic. We must keep fighting to get this poison off the streets! [[url]]"}}, "foreign_policy": {"count": 994, "percent": 0.0895, "rank": 114.0, "sources": {"floor": {"count": 18, "percent": 0.0556}, "newsletters": {"count": 796, "percent": 0.0628}, "statements": {"count": 156, "percent": 0.2372}, "tweets": {"count": 24, "percent": 0.0417}}, "example": {"date": "", "source": "newsletters", "text": "H Res. 12 - This resolution establishes a Select Subcommittee on the Weaponization of the Federal Government as a select investigative subcommittee of the Committee on the Judiciary. Protecting America's Strategic Petroleum Reserve from China Act (HR 22) - This bill prohibits the sale and export of crude oil from the Strategic Petroleum Reserve to China."}}, "legislative_discussion": {"count": 994, "percent": 0.1992, "rank": 281.0, "sources": {"floor": {"count": 18, "percent": 0.7222}, "newsletters": {"count": 796, "percent": 0.1533}, "statements": {"count": 156, "percent": 0.3718}, "tweets": {"count": 24, "percent": 0.2083}}, "example": {"date": "", "source": "newsletters", "text": "Please read about my week below: Top Reads of the Week A Recap of My Week Updates from Agencies Top Reads of the Week FLORIDA DAILY: Congressman Dunn Supports the Red Snapper Act THE EPOCH TIMES: The Doctor Who Can Rebuild Trust: Joseph Ladapo WALL STREET JOURNAL: US Jobless Claims Rise Slightly in Tight Labor Market A Recap of My Week H ere's What I'm Supporting I recently joined a letter to House leadership calling for a vote on the Medicare Multi-Cancer Early Detection Screening Coverage Act (HR 1946), which would create a pathway for Medicare to cover emerging blood-based cancer screenings, technology with the potential to detect cancer earlier than ever. I also joined a letter to the Department of Defense Education Activity Director , Thomas M Brady, regarding the recent surge of obscene, pornographic materials active within the Department of Defense Education Activity (DoDEA) school system."}}}}