{"first_name": "Neal", "last_name": "Dunn", "party": "Republican", "state": "FL", "type": "rep", "twitter": "DrNealDunnFL2", "district": 2, "scorecard": {"blame": {"count": 986, "percent": 0.0538, "rank": 369.0, "sources": {"floor": {"count": 18, "percent": 0.0}, "newsletters": {"count": 796, "percent": 0.0364}, "statements": {"count": 148, "percent": 0.1351}, "tweets": {"count": 24, "percent": 0.1667}}, "example": {"date": "", "source": "newsletters", "text": "House Democrats cut out House Republicans every step of the way and delayed a final appropriations bill until after the election to hide their costly wish list items. They want to pass this bill at the eleventh hour while America sleeps, so they can ram through trillions of dollars in new reckless spending to fund their failed agenda."}}, "compromise": {"count": 989, "percent": 0.0152, "rank": 424.0, "sources": {"floor": {"count": 18, "percent": 0.0556}, "newsletters": {"count": 796, "percent": 0.0063}, "statements": {"count": 151, "percent": 0.0596}, "tweets": {"count": 24, "percent": 0.0}}, "example": {"date": "", "source": "floor", "text": "This bipartisan legislation provides a solution that works for everyone, and I encourage my colleagues to vote in favor of HR 1108."}}, "credit_claiming": {"count": 994, "percent": 0.0553, "rank": 421.0, "sources": {"floor": {"count": 18, "percent": 0.0556}, "newsletters": {"count": 796, "percent": 0.0377}, "statements": {"count": 156, "percent": 0.141}, "tweets": {"count": 24, "percent": 0.0833}}, "example": {"date": "", "source": "newsletters", "text": "So, in just 19 days, House Republicans will provide a check on the Biden Administration, rein in reckless spending, and work to restore fiscal responsibility in Washington. Please read about my week below: Top Reads of the Week A Recap of My Week Updates from Agencies Top Reads of the Week WMBB (PANAMA CITY): Florida cop treated for overdose after possible fentanyl exposure, police say (VIDEO) FLORIDA DAILY: Florida Delegation Requests Relief For Specialty Crop Insurance Providers WALL STREET JOURNAL: Utility Bills Rise as Americans Pay Off Storm-Recovery Costs for Decades to Come A Recap of My Week GOP Doctors Caucus I recently joined the GOP Doctors Caucus on a letter to House leadership requesting support for policies to address impending Medicare payment cuts in legislation moving through the US House of Representatives before the end of the year."}}, "insult": {"count": 986, "percent": 0.001, "rank": 384.5, "sources": {"floor": {"count": 18, "percent": 0.0}, "newsletters": {"count": 796, "percent": 0.0013}, "statements": {"count": 148, "percent": 0.0}, "tweets": {"count": 24, "percent": 0.0}}, "example": {"date": "", "source": "newsletters", "text": "Schiff led the modern-day witch hunt against President Trump, and former Speaker Pelosi and House Democrats strongly supported and encouraged this dangerous behavior. We cannot continue to let Adam Schiff get away with the damage he's done."}}, "policy": {"count": 994, "percent": 0.3421, "rank": 456.0, "sources": {"floor": {"count": 18, "percent": 0.9444}, "newsletters": {"count": 796, "percent": 0.2764}, "statements": {"count": 156, "percent": 0.609}, "tweets": {"count": 24, "percent": 0.3333}}, "example": {"date": "", "source": "newsletters", "text": "Sincerely, Dr. Neal Dunn Member of Congress Constituent Casework Corner A veteran contacted my office when both of their children's Chapter 35 benefits, also known as VA education benefits, hadn't been paid out in months by the Department of Veterans Affairs. Both children were certified for several semesters."}}, "foreign_policy": {"count": 994, "percent": 0.0895, "rank": 114.0, "sources": {"floor": {"count": 18, "percent": 0.0556}, "newsletters": {"count": 796, "percent": 0.0628}, "statements": {"count": 156, "percent": 0.2372}, "tweets": {"count": 24, "percent": 0.0417}}, "example": {"date": "", "source": "newsletters", "text": "H Res. 12 - This resolution establishes a Select Subcommittee on the Weaponization of the Federal Government as a select investigative subcommittee of the Committee on the Judiciary. Protecting America's Strategic Petroleum Reserve from China Act (HR 22) - This bill prohibits the sale and export of crude oil from the Strategic Petroleum Reserve to China."}}, "legislative_discussion": {"count": 994, "percent": 0.1992, "rank": 281.0, "sources": {"floor": {"count": 18, "percent": 0.7222}, "newsletters": {"count": 796, "percent": 0.1533}, "statements": {"count": 156, "percent": 0.3718}, "tweets": {"count": 24, "percent": 0.2083}}, "example": {"date": "", "source": "newsletters", "text": "The Born-Alive Abortion Survivors Protection Act (HR 26) would provide that if a child is born alive after surviving an abortion, any health-care practitioner present must exercise the same degree of care to preserve the life and health of the child that they would exercise for any other child of the same gestational age. The survivor must then be immediately transported to a hospital."}}}}