{"first_name": "John", "last_name": "Duarte", "party": "Republican", "state": "CA", "type": "rep", "twitter": "Duarte4Congress", "district": 13, "scorecard": {"blame": {"count": 270, "percent": 0.0704, "rank": 320.0, "sources": {"floor": {"count": 70, "percent": 0.2429}, "newsletters": {"count": 200, "percent": 0.01}, "statements": {"count": null, "percent": null}, "tweets": {"count": null, "percent": null}}, "example": {"date": "", "source": "floor", "text": "There is nothing left for the other expenses they have in their lives, and this is all due to regulatory overload. We are overburdened by regulations, we are overburdened by restrictions on what we do, and the American working family is paying for it every day."}}, "compromise": {"count": 270, "percent": 0.1704, "rank": 13.0, "sources": {"floor": {"count": 70, "percent": 0.0286}, "newsletters": {"count": 200, "percent": 0.22}, "statements": {"count": null, "percent": null}, "tweets": {"count": null, "percent": null}}, "example": {"date": "", "source": "newsletters", "text": "After years of uncertainty, Democrats and Republicans have worked together to build a stronger economy that protects the futures of our children. This plan supports working families by protecting and increasing funding for social security, Medicare, and veterans' benefits, ends wasteful Washington spending programs, and fights out of control inflation."}}, "credit_claiming": {"count": 270, "percent": 0.1963, "rank": 58.0, "sources": {"floor": {"count": 70, "percent": 0.0}, "newsletters": {"count": 200, "percent": 0.265}, "statements": {"count": null, "percent": null}, "tweets": {"count": null, "percent": null}}, "example": {"date": "", "source": "newsletters", "text": "By working with President Biden, we have taken the first step in keeping the US from defaulting and put an end to out-of-control inflationary spending. Growing our economy, lifting families out of poverty, and protecting our veterans is a win for California and a win for our children,\" said Rep. Duarte."}}, "insult": {"count": 270, "percent": 0.0037, "rank": 335.0, "sources": {"floor": {"count": 70, "percent": 0.0143}, "newsletters": {"count": 200, "percent": 0.0}, "statements": {"count": null, "percent": null}, "tweets": {"count": null, "percent": null}}, "example": {"date": "", "source": "floor", "text": "And what Congressman LaMalfa has presented here today is an absolute insult to every working family in America who is having trouble affording the nutrition on their dinner plate that they could better afford just a few short years ago. This is going to be the first generation in American history--my prediction--where we will see the diverse nutrition of produce and protein taken off the American working family's dinner plate and reverting American families to more starch-based diets that go in the opposite direction of what every health nutritionist tells us we need to be doing with American food plans."}}, "policy": {"count": 270, "percent": 0.5704, "rank": 114.0, "sources": {"floor": {"count": 70, "percent": 0.4857}, "newsletters": {"count": 200, "percent": 0.6}, "statements": {"count": null, "percent": null}, "tweets": {"count": null, "percent": null}}, "example": {"date": "", "source": "floor", "text": "As we look at our global food system that is based in California and throughout many States, a global food system will ship food to whoever can afford it best. In the emerging middle and upper classes in India and China, where they are running a carbon economy, where they are creating jobs, where their grid stays lit 24/7 and has plenty of room for industrial growth, is where we are seeing opportunity in work and jobs, and it is where Americans are going to see their dinner flow to."}}, "foreign_policy": {"count": 270, "percent": 0.0074, "rank": 459.5, "sources": {"floor": {"count": 70, "percent": 0.0}, "newsletters": {"count": 200, "percent": 0.01}, "statements": {"count": null, "percent": null}, "tweets": {"count": null, "percent": null}}, "example": {"date": "", "source": "newsletters", "text": "Not only does this bill save billions of American tax dollars, but it protects the benefits of our military members while expanding our defense capabilities. I would like to thank my Democrat and Republican colleagues on the Armed Services Committee for their hard work in putting together this crucial piece of legislation."}}, "legislative_discussion": {"count": 270, "percent": 0.3, "rank": 95.0, "sources": {"floor": {"count": 70, "percent": 0.0429}, "newsletters": {"count": 200, "percent": 0.39}, "statements": {"count": null, "percent": null}, "tweets": {"count": null, "percent": null}}, "example": {"date": "", "source": "floor", "text": "So it is interesting at times to understand some of the investigations and things that we need to write new laws for, or we claim we need to write new laws because one politician does this or his son does that. We can't possibly need new laws to prosecute some of this corruption."}}}}