{"first_name": "Diana", "last_name": "DeGette", "party": "Democrat", "state": "CO", "type": "rep", "twitter": "RepDianaDeGette", "district": 1, "senate_class": 0, "facebook": "DianaDeGette", "website": "https://degette.house.gov", "contact": null, "birthday": "1957-07-29", "serving_congress_since": "1997-01-03", "serving_current_chamber_since": "1997-01-03", "scorecard": {"blame": {"count": 237, "percent": 0.1266, "rank": 180.5, "sources": {"floor": {"count": 34, "percent": 0.0588}, "newsletters": {"count": 187, "percent": 0.139}, "statements": {"count": 2, "percent": 0.0}, "tweets": {"count": 14, "percent": 0.1429}}, "example": {"date": "", "source": "newsletters", "text": "It's nothing more than a shameless attempt to use the threat of criminal penalties to deter more doctors from providing abortion services in the first place. The other measure the GOP brought up this week was a resolution to condemn recent attacks on anti-choice facilities, but said nothing about similar attacks on women's health clinics across the US The fact that the House Republicans were willing to go to such lengths to condemn the attacks against anti-choice groups, while remaining silent about the growing violence against abortion providers, sends a very dangerous message to extremists across the country."}}, "compromise": {"count": 237, "percent": 0.0338, "rank": 278.0, "sources": {"floor": {"count": 34, "percent": 0.0}, "newsletters": {"count": 187, "percent": 0.0428}, "statements": {"count": 2, "percent": 0.0}, "tweets": {"count": 14, "percent": 0.0}}, "example": {"date": "", "source": "newsletters", "text": "While this week, once again, highlighted Republicans' desire to advance their extreme agenda no matter what, I remain hopeful that there will still be opportunities to work together to get things done because I am committed, regardless of whether I'm in the minority or majority, to doing everything I can to continue advancing our priorities and help move this country forward. And I hope you will continue to share with me all of your thoughts and ideas along the way."}}, "credit_claiming": {"count": 237, "percent": 0.0802, "rank": 312.5, "sources": {"floor": {"count": 34, "percent": 0.0}, "newsletters": {"count": 187, "percent": 0.1016}, "statements": {"count": 2, "percent": 0.0}, "tweets": {"count": 14, "percent": 0.0}}, "example": {"date": "", "source": "newsletters", "text": "And its passage marks not only a big win for marriage equality in this country, but also a major victory in our ongoing fight to ensure true equality for all Americans. In addition to passing this landmark measure, we also took steps this week to better protect consumers trying to purchase tickets to attend any one of the thousands of concerts, shows and events that are held every year across this country."}}, "insult": {"count": 237, "percent": 0.0042, "rank": 323.0, "sources": {"floor": {"count": 34, "percent": 0.0}, "newsletters": {"count": 187, "percent": 0.0}, "statements": {"count": 2, "percent": 0.0}, "tweets": {"count": 14, "percent": 0.0714}}, "example": {"date": "", "source": "tweets", "text": "Let’s be clear: The only reason we’re facing a possible default is because Republicans continue to hold our economy hostage unless we agree to their extreme agenda. The GOP created this crisis. By refusing to end it, they are threatening to do real harm to millions of Americans."}}, "policy": {"count": 237, "percent": 0.5781, "rank": 104.0, "sources": {"floor": {"count": 34, "percent": 0.2941}, "newsletters": {"count": 187, "percent": 0.6417}, "statements": {"count": 2, "percent": 0.0}, "tweets": {"count": 14, "percent": 0.5}}, "example": {"date": "", "source": "newsletters", "text": "Finally, as many of you have probably heard by now, our city has seen a sudden influx of migrants arriving here in recent days. While there is still a lot we do not know about where these migrants originally came from, or how they arrived in Denver, we do know that our first priority must be to provide them the assistance they need."}}, "foreign_policy": {"count": 237, "percent": 0.0127, "rank": 431.5, "sources": {"floor": {"count": 34, "percent": 0.0}, "newsletters": {"count": 187, "percent": 0.0107}, "statements": {"count": 2, "percent": 0.0}, "tweets": {"count": 14, "percent": 0.0714}}, "example": {"date": "", "source": "tweets", "text": "I’m glad to hear that President Biden will be visiting Hiroshima’s Peace Memorial Park while he’s in Japan this week. His visit will send a powerful message about the strength of our alliance and reaffirms our commitment to peace, security and denuclearization around the world."}}, "legislative_discussion": {"count": 237, "percent": 0.2152, "rank": 230.5, "sources": {"floor": {"count": 34, "percent": 0.2059}, "newsletters": {"count": 187, "percent": 0.2193}, "statements": {"count": 2, "percent": 0.0}, "tweets": {"count": 14, "percent": 0.2143}}, "example": {"date": "", "source": "newsletters", "text": " News from Representative DeGette ABOUT DIANA SERVICES ISSUES NEWSROOM STUDENTS CONTACT ME Dear Friend, In a truly historic moment, the US House voted this week to enshrine the right of interracial and same-sex couples to marry and ensure that the federal government never gets in the way of a person marrying who they love. This important legislation is now headed to President Biden's desk to be signed into law."}}}}