{"first_name": "Byron", "last_name": "Donalds", "party": "Republican", "state": "FL", "type": "rep", "twitter": "RepDonaldsPress", "district": 19, "scorecard": {"blame": {"count": 1958, "percent": 0.1803, "rank": 94.5, "sources": {"floor": {"count": 45, "percent": 0.1556}, "newsletters": {"count": 1795, "percent": 0.1599}, "statements": {"count": null, "percent": null}, "tweets": {"count": 118, "percent": 0.5}}, "example": {"date": "", "source": "newsletters", "text": "We care more about the border security of other countries around the world than we do our nation. Especially while we have fentanyl killing our citizens and have massive amounts of people rushing across the southern border, which will put more pressure on our localities, this is where Senate Republicans under Mitch McConnel have taken us."}}, "compromise": {"count": 1958, "percent": 0.0536, "rank": 182.0, "sources": {"floor": {"count": 45, "percent": 0.0444}, "newsletters": {"count": 1795, "percent": 0.0563}, "statements": {"count": null, "percent": null}, "tweets": {"count": 118, "percent": 0.0169}}, "example": {"date": "", "source": "newsletters", "text": "Over the last 60 years, these events have increased substantially--impacting local economies, our nation's ecosystems, and the American people's health. \"Safeguarding public health and our coastal ecosystems requires the collective collaboration of federal, state, and local governments."}}, "credit_claiming": {"count": 1958, "percent": 0.1272, "rank": 164.0, "sources": {"floor": {"count": 45, "percent": 0.0222}, "newsletters": {"count": 1795, "percent": 0.1287}, "statements": {"count": null, "percent": null}, "tweets": {"count": 118, "percent": 0.1441}}, "example": {"date": "", "source": "newsletters", "text": " DONALDS: I Stand Firmly As An Advocate For The Pro-Life Movement DONALDS: I Stand Firmly As An Advocate For The Pro-Life Movement WASHINGTON - Today, Congressman Byron Donalds (R-FL) issued the following statement after voting for legislation to save the life of any infant born-alive during an abortion procedure and to condemn the recent nationwide attacks on pro-life facilities, groups, and churches. \"As a father, I can safely say that my three children are the greatest gifts I have ever received."}}, "insult": {"count": 1955, "percent": 0.0271, "rank": 93.5, "sources": {"floor": {"count": 45, "percent": 0.0222}, "newsletters": {"count": 1795, "percent": 0.0206}, "statements": {"count": null, "percent": null}, "tweets": {"count": 115, "percent": 0.1304}}, "example": {"date": "", "source": "tweets", "text": "It's DISGUSTING the MSM is actively ignoring Biden's corruption. He is compromised. 16+ LLCs & shady business deals in China & Romania, all based around influence-peddling his name while VP. If he somehow didn’t know, he could be the dumbest person in the history of the planet. [[url]]"}}, "policy": {"count": 1958, "percent": 0.5965, "rank": 83.0, "sources": {"floor": {"count": 45, "percent": 0.4889}, "newsletters": {"count": 1795, "percent": 0.6089}, "statements": {"count": null, "percent": null}, "tweets": {"count": 118, "percent": 0.4492}}, "example": {"date": "", "source": "newsletters", "text": "\"We urge you to take all steps necessary to stop the soon to be finalized omnibus spending bill negotiated with Democrats. At the very least, due respect for Americans who elected us would call for not passing a \"lame duck\" spending bill just days before Members fly home for Christmas and two weeks before a new Republican majority is sworn in for the 118th Congress."}}, "foreign_policy": {"count": 1955, "percent": 0.091, "rank": 107.0, "sources": {"floor": {"count": 45, "percent": 0.0444}, "newsletters": {"count": 1795, "percent": 0.0936}, "statements": {"count": null, "percent": null}, "tweets": {"count": 115, "percent": 0.0696}}, "example": {"date": "", "source": "newsletters", "text": "Watch the full interview here . Senate Republicans should not be supporting the Omnibus bill: \"This bill gives $410 million to Jordan, Lebanon, Egypt, Tunisia, and Oman, for border security, and the bill says $150 million will go to Jordan."}}, "legislative_discussion": {"count": 1958, "percent": 0.3192, "rank": 71.0, "sources": {"floor": {"count": 45, "percent": 0.3111}, "newsletters": {"count": 1795, "percent": 0.3281}, "statements": {"count": null, "percent": null}, "tweets": {"count": 118, "percent": 0.1864}}, "example": {"date": "", "source": "newsletters", "text": " Donalds, Roy, Perry, And 10 Others Send Letter to US Senate Republicans Urging Them To Derail Omnibus Spending Bill Donalds, Roy, Perry, And 10 Others Send Letter To US Senate Republicans Urging Them To Derail Omnibus Spending Bill Enews Sign Up | Visit My Website | View Online For Immediate Release December 20, 2022 Contact: Harrison Fields (202) 225-2536 Donalds, Roy, Perry, And 10 Others Send Letter To US Senate Republicans Urging Them To Derail Omnibus Spending Bill WASHINGTON - Congressman Byron Donalds (R-FL) issued the following statement regarding his support of a letter by Congressmen Chip Roy (R-TX), Scott Perry (R-PA), and ten additional Members and Members-Elect urging Senate Republicans to take all steps necessary to stop the omnibus spending bill. Cosponsors of the letter also include Representatives Bishop (R-NC), Biggs (R-AZ), Rosendale (R-MT), Gaetz (R-FL), Norman (R-SC), Good (R-VA), Clyde (R-GA), and Members of Congress-Elect Luna (R-FL), Ogles (R-TN), and Crane (R-AZ)."}}}}