{"first_name": "Anna", "last_name": "Eshoo", "party": "Democrat", "state": "CA", "type": "rep", "twitter": "RepAnnaEshoo", "district": 16, "scorecard": {"blame": {"count": 617, "percent": 0.0583, "rank": 357.0, "sources": {"floor": {"count": 92, "percent": 0.0}, "newsletters": {"count": 521, "percent": 0.0691}, "statements": {"count": null, "percent": null}, "tweets": {"count": 4, "percent": 0.0}}, "example": {"date": "", "source": "newsletters", "text": "Former President's Tax Returns After nearly four years of failed legal challenges from the former President, the Ways and Means Committee voted this week to release his tax returns. This effort would not have been necessary if the former President released his tax returns when he ran for office, just as every major candidate from both parties has for the past 40 years."}}, "compromise": {"count": 617, "percent": 0.0389, "rank": 251.0, "sources": {"floor": {"count": 92, "percent": 0.0109}, "newsletters": {"count": 521, "percent": 0.0441}, "statements": {"count": null, "percent": null}, "tweets": {"count": 4, "percent": 0.0}}, "example": {"date": "", "source": "newsletters", "text": "I'm proud to finish what has been one of the most productive Congresses in US history, including yesterday's passage of a bill that funds the government and will improve the lives of American communities coast to coast. Funding the Government The bipartisan Consolidated Appropriations Act is a package of 12 bills that fund every federal agency through the end of fiscal year 2023."}}, "credit_claiming": {"count": 617, "percent": 0.1086, "rank": 216.5, "sources": {"floor": {"count": 92, "percent": 0.1087}, "newsletters": {"count": 521, "percent": 0.1094}, "statements": {"count": null, "percent": null}, "tweets": {"count": 4, "percent": 0.0}}, "example": {"date": "", "source": "newsletters", "text": "PASSED: ARPA-H and Diversity in Clinical Trials I'm very proud that the Consolidated Appropriations Act also included two major health bills I authored in this Congress, the ARPA-H Act and the DEPICT Act . The ARPA-H Act establishes the Advanced Research Projects Agency for Health, a groundbreaking new health agency with a mighty mission: curing and treating the world's deadliest diseases, including cancer, diabetes, and Alzheimer's."}}, "insult": {"count": 617, "percent": 0.0, "rank": 483.0, "sources": {"floor": {"count": 92, "percent": 0.0}, "newsletters": {"count": 521, "percent": 0.0}, "statements": {"count": null, "percent": null}, "tweets": {"count": 4, "percent": 0.0}}}, "example": null, "policy": {"count": 617, "percent": 0.5478, "rank": 136.0, "sources": {"floor": {"count": 92, "percent": 0.1304}, "newsletters": {"count": 521, "percent": 0.62}, "statements": {"count": null, "percent": null}, "tweets": {"count": 4, "percent": 0.75}}, "example": {"date": "", "source": "newsletters", "text": "I actually read every communication and every constituent receives a personal response to their specific questions and comments from me. This week, 1,488 constituents contacted me about issues including: 114 messages opposed to Medicare budget cuts 107 messages in support of increasing benefits under the Supplemental Nutrition Assistance Program (SNAP) 89 messages in support of the ongoing pro-democracy protests in Iran Anna's Work in the News Congressional representatives want more time for laid-off H-1B visa holders to find new jobs - San Francisco Chronicle Recommended Reading Zelensky's visit highlights that freedom is winning in Ukraine - for now -Washington Post The Last Lesson of the Jan. 6 Committee -New York Times # # # I close with this thought."}}, "foreign_policy": {"count": 617, "percent": 0.047, "rank": 252.0, "sources": {"floor": {"count": 92, "percent": 0.0}, "newsletters": {"count": 521, "percent": 0.0537}, "statements": {"count": null, "percent": null}, "tweets": {"count": 4, "percent": 0.25}}, "example": {"date": "", "source": "newsletters", "text": "I'm proud to have voted for every effort in support of democracy and the Ukrainian people. We can never be exhausted of democracy."}}, "legislative_discussion": {"count": 617, "percent": 0.3079, "rank": 83.0, "sources": {"floor": {"count": 92, "percent": 0.0978}, "newsletters": {"count": 521, "percent": 0.3436}, "statements": {"count": null, "percent": null}, "tweets": {"count": 4, "percent": 0.5}}, "example": {"date": "", "source": "newsletters", "text": "Trump's refusal to follow this bipartisan tradition shows why Congress should pass my legislation, the Presidential Tax Transparency Act , requiring every presidential candidate to disclose their tax returns before they're elected. The American people must be confident that their president works in the public interest, not for their own financial gain."}}}}