{"first_name": "Anna", "last_name": "Eshoo", "party": "Democrat", "state": "CA", "type": "rep", "twitter": "RepAnnaEshoo", "district": 16, "senate_class": 0, "facebook": "RepAnnaEshoo", "website": "https://eshoo.house.gov", "contact": null, "birthday": "1942-12-13", "serving_congress_since": "1993-01-03", "serving_current_chamber_since": "1993-01-03", "scorecard": {"blame": {"count": 617, "percent": 0.0583, "rank": 357.0, "sources": {"floor": {"count": 92, "percent": 0.0}, "newsletters": {"count": 521, "percent": 0.0691}, "statements": {"count": null, "percent": null}, "tweets": {"count": 4, "percent": 0.0}}, "example": {"date": "", "source": "newsletters", "text": "Former President's Tax Returns After nearly four years of failed legal challenges from the former President, the Ways and Means Committee voted this week to release his tax returns. This effort would not have been necessary if the former President released his tax returns when he ran for office, just as every major candidate from both parties has for the past 40 years."}}, "compromise": {"count": 617, "percent": 0.0389, "rank": 251.0, "sources": {"floor": {"count": 92, "percent": 0.0109}, "newsletters": {"count": 521, "percent": 0.0441}, "statements": {"count": null, "percent": null}, "tweets": {"count": 4, "percent": 0.0}}, "example": {"date": "", "source": "newsletters", "text": "During her tenure, Speaker Pelosi has produced an unmatched record of legislation, including more bipartisan bills to benefit the American people than any other Speaker in American history. As President Obama said at her portrait unveiling, she is \"one of the most accomplished legislators in American history.\""}}, "credit_claiming": {"count": 617, "percent": 0.1086, "rank": 216.5, "sources": {"floor": {"count": 92, "percent": 0.1087}, "newsletters": {"count": 521, "percent": 0.1094}, "statements": {"count": null, "percent": null}, "tweets": {"count": 4, "percent": 0.0}}, "example": {"date": "", "source": "newsletters", "text": "The summit brought together top leaders in public health, biomedical research, and policy, including FDA Commissioner Robert Califf, CDC Director Rochelle Walensky, and Senators Cory Booker and Bill Cassidy to discuss how to tackle major public health challenges. In my conversation with Esther Krofah, Executive Vice President of Health at the Milken Institute, I discussed my legislation to improve diversity in clinical trials and my work to establish the Advanced Research Project Agency for Health, ARPA-H This new health agency has a mighty mission: to cure and treat the world's deadliest diseases, including cancer, diabetes, and Alzheimer's."}}, "insult": {"count": 617, "percent": 0.0, "rank": 483.0, "sources": {"floor": {"count": 92, "percent": 0.0}, "newsletters": {"count": 521, "percent": 0.0}, "statements": {"count": null, "percent": null}, "tweets": {"count": 4, "percent": 0.0}}}, "example": null, "policy": {"count": 617, "percent": 0.5478, "rank": 136.0, "sources": {"floor": {"count": 92, "percent": 0.1304}, "newsletters": {"count": 521, "percent": 0.62}, "statements": {"count": null, "percent": null}, "tweets": {"count": 4, "percent": 0.75}}, "example": {"date": "", "source": "newsletters", "text": "I actually read every communication and every constituent receives a personal response to their specific questions and comments from me. This week, 2,325 constituents contacted me about issues including: 113 messages against energy permitting reform that weakens environmental regulations 83 messages in support of seating the Cherokee Nation's first Delegate to Congress 56 messages in support of the SSI Penalty Savings Act Recommended Reading Congress awards gold medals to police who defended Capitol on Jan. 6 - Washington Post Renewable energy: First ocean areas to be leased off California for floating wind turbines - Santa Cruz Sentinel The crisis of student mental health is much vaster than we realize -Washington Post # # # I close with this thought."}}, "foreign_policy": {"count": 617, "percent": 0.047, "rank": 252.0, "sources": {"floor": {"count": 92, "percent": 0.0}, "newsletters": {"count": 521, "percent": 0.0537}, "statements": {"count": null, "percent": null}, "tweets": {"count": 4, "percent": 0.25}}, "example": {"date": "", "source": "newsletters", "text": "I stand by the Biden Administration in condemning Russia's human rights abuses and remain resolved to securing the release of all wrongfully detained Americans including Paul Whelan. Real ID Deadline Extended The US Homeland Security Department (DHS) announced this week that Americans will now have until May 2025 to acquire REAL IDs in order to board flights or enter certain federal government facilities."}}, "legislative_discussion": {"count": 617, "percent": 0.3079, "rank": 83.0, "sources": {"floor": {"count": 92, "percent": 0.0978}, "newsletters": {"count": 521, "percent": 0.3436}, "statements": {"count": null, "percent": null}, "tweets": {"count": 4, "percent": 0.5}}, "example": {"date": "", "source": "newsletters", "text": "Beginning in May 2025, as required by the REAL ID Act which passed Congress in 2005, federal agencies, including the Transportation Security Administration (TSA), will be prohibited from accepting driver's licenses and other identification cards that do not meet new federal standards. According to the US Travel Association, an estimated 83 million Americans, roughly 34 percent, are still without an enhanced form of ID that would be accepted to travel domestically or abroad, which includes a US passport or passport card, US military ID, or DHS trusted traveler cards."}}}}