{"first_name": "Lizzie", "last_name": "Fletcher", "party": "Democrat", "state": "TX", "type": "rep", "twitter": "RepFletcher", "district": 7, "senate_class": 0, "facebook": null, "website": "https://fletcher.house.gov", "contact": null, "birthday": "1975-02-13", "serving_congress_since": "2019-01-03", "serving_current_chamber_since": "2019-01-03", "scorecard": {"blame": {"count": 1071, "percent": 0.0131, "rank": 499.0, "sources": {"floor": {"count": 2, "percent": 0.5}, "newsletters": {"count": 1034, "percent": 0.0126}, "statements": {"count": 7, "percent": 0.0}, "tweets": {"count": 28, "percent": 0.0}}, "example": {"date": "", "source": "newsletters", "text": "Our district is home to schools in some of the largest and most diverse Independent School Districts (ISD) in Texas, including Alief ISD, Fort Bend ISD, Houston ISD (HISD), and Lamar Consolidated ISD. On Wednesday the Texas Education Agency (TEA) made final its decision to take over HISD with the intention of replacing HISD's superintendent and other elected trustees with an appointed superintendent and board of managers within the next few months."}}, "compromise": {"count": 1071, "percent": 0.0607, "rank": 152.0, "sources": {"floor": {"count": 2, "percent": 0.0}, "newsletters": {"count": 1034, "percent": 0.0609}, "statements": {"count": 7, "percent": 0.0}, "tweets": {"count": 28, "percent": 0.0714}}, "example": {"date": "", "source": "newsletters", "text": "This bipartisan bill, which has broad support in the Senate, would help protect coastal communities by creating a new stream of funding for coastal infrastructure and flood resiliency projects and help incentivize new clean energy projects. If enacted, the RISEE Act could provide a new source of funds for the Coastal Texas Study and the Ike Dike."}}, "credit_claiming": {"count": 1071, "percent": 0.0868, "rank": 292.0, "sources": {"floor": {"count": 2, "percent": 0.0}, "newsletters": {"count": 1034, "percent": 0.0803}, "statements": {"count": 7, "percent": 0.5714}, "tweets": {"count": 28, "percent": 0.2143}}, "example": {"date": "", "source": "newsletters", "text": "It authorizes a pay raise and vital benefits for service members, protects military supply chains, makes investments to improve military capability, and authorizes several of the water resources projects I advocated for that benefit our district and our region-including important modifications to the Houston Ship Channel Improvement Project, and the Coastal Texas Study, a transformative project to reduce storm surge at the coast, protecting our region and our country from catastrophic damage. This week, I continued to advocate for my bill, the bipartisan Reinvesting in Shoreline Economies and Ecosystems ( RISEE ) Act ."}}, "insult": {"count": 1071, "percent": 0.0, "rank": 483.0, "sources": {"floor": {"count": 2, "percent": 0.0}, "newsletters": {"count": 1034, "percent": 0.0}, "statements": {"count": 7, "percent": 0.0}, "tweets": {"count": 28, "percent": 0.0}}}, "example": null, "policy": {"count": 1071, "percent": 0.4715, "rank": 274.0, "sources": {"floor": {"count": 2, "percent": 0.0}, "newsletters": {"count": 1034, "percent": 0.4691}, "statements": {"count": 7, "percent": 0.7143}, "tweets": {"count": 28, "percent": 0.5357}}, "example": {"date": "", "source": "newsletters", "text": "The health insurance marketplace is now open! You have until December 15 to browse plans at and get quality, affordable health insurance for you and your family."}}, "foreign_policy": {"count": 1071, "percent": 0.0626, "rank": 195.0, "sources": {"floor": {"count": 2, "percent": 0.0}, "newsletters": {"count": 1034, "percent": 0.0638}, "statements": {"count": 7, "percent": 0.0}, "tweets": {"count": 28, "percent": 0.0357}}, "example": {"date": "", "source": "newsletters", "text": "HR 22 bans exports from the Strategic Petroleum Reserve (SPR) to China. As a country, the US must uphold international rule of law when necessary, safeguard our strategic petroleum reserve, and prioritize national security, and that is why I voted for H Res. 11 and HR 22."}}, "legislative_discussion": {"count": 1071, "percent": 0.3035, "rank": 88.0, "sources": {"floor": {"count": 2, "percent": 0.0}, "newsletters": {"count": 1034, "percent": 0.3027}, "statements": {"count": 7, "percent": 0.4286}, "tweets": {"count": 28, "percent": 0.3214}}, "example": {"date": "", "source": "newsletters", "text": "I also co-sponsored a bill (HR 9332) to conform federal tax law with the Texas Constitution to allow for the continued benefit to the fullest extent possible from the financial leverage of the Permanent University Fund to the State of Texas. Throughout the week, I joined my colleagues in signing several letters on issues important to our community: A letter to Senate Leadership urging the Senate to affirm the Equal Rights Amendment (ERA) as the 28th Amendment to the Constitution; A letter to House Appropriations Leadership supporting the highest possible funding level for the US Bureau of Alcohol, Tobacco, Firearms, and Explosives in the Fiscal Year 2023 end-of-year spending bill; and A letter to President Biden urging the Administration to coordinate agencies and leaders to execute a unified national strategy to monitor and combat antisemitism."}}}}