{"first_name": "Mazie", "last_name": "Hirono", "party": "Democrat", "state": "HI", "type": "sen", "twitter": "MazieHirono", "district": 0, "senate_class": 1, "facebook": "senatorhirono", "website": "https://www.hirono.senate.gov", "contact": "https://www.hirono.senate.gov/contact", "birthday": "1947-11-03", "serving_congress_since": "2007-01-03", "serving_current_chamber_since": "2013-01-03", "scorecard": {"blame": {"count": 406, "percent": 0.0419, "rank": 403.0, "sources": {"floor": {"count": 82, "percent": 0.1829}, "newsletters": {"count": 299, "percent": 0.0}, "statements": {"count": null, "percent": null}, "tweets": {"count": 25, "percent": 0.08}}, "example": {"date": "", "source": "tweets", "text": "The GOP's #DefaultonAmerica Act would be disastrous for our country. Their extreme bill cuts veterans' services, strips health care from millions, & hinders our economic growth. This is what they have to show after holding our economy hostage for months? It's reckless & cruel."}}, "compromise": {"count": 406, "percent": 0.0616, "rank": 145.0, "sources": {"floor": {"count": 82, "percent": 0.0488}, "newsletters": {"count": 299, "percent": 0.0702}, "statements": {"count": null, "percent": null}, "tweets": {"count": 25, "percent": 0.0}}, "example": {"date": "", "source": "newsletters", "text": "And as of today, more than 35,000 households across the state are receiving affordable internet due to the Bipartisan Infrastructure Law. Many more projects will be added in the coming months, as funding opportunities become grant awards and as formula funds become specific projects."}}, "credit_claiming": {"count": 406, "percent": 0.0493, "rank": 449.0, "sources": {"floor": {"count": 82, "percent": 0.0244}, "newsletters": {"count": 299, "percent": 0.0569}, "statements": {"count": null, "percent": null}, "tweets": {"count": 25, "percent": 0.04}}, "example": {"date": "", "source": "newsletters", "text": "By reaching communities all across Hawaii - including rural communities and historically underserved populations - the law makes critical investments that will improve lives for Hawaiians and position the state for success. The entire fact sheet is included here as well: Two programs announced recently specific to Hawaii are: Department of Interior- National Park Service 2023 Native American Graves Protection and Repatriation Act (NGRPA) Consultation/Documentation Grants and FY2023 NAGPRA Repatriation Grants CFDA Number 15.922 supports efforts determining the geographical origin, cultural affiliation, and other basic facts surrounding the acquisition of Native Hawaiian cultural items."}}, "insult": {"count": 406, "percent": 0.0074, "rank": 252.5, "sources": {"floor": {"count": 82, "percent": 0.0122}, "newsletters": {"count": 299, "percent": 0.0}, "statements": {"count": null, "percent": null}, "tweets": {"count": 25, "percent": 0.08}}, "example": {"date": "", "source": "tweets", "text": "White nationalism is a danger to our society and has no place in our Armed Forces. Senator Tuberville's remarks are vile, dangerous, and an insult to the vast majority of patriotic service members who serve our country with distinction. [[url]]"}}, "policy": {"count": 406, "percent": 0.5911, "rank": 92.0, "sources": {"floor": {"count": 82, "percent": 0.3171}, "newsletters": {"count": 299, "percent": 0.6756}, "statements": {"count": null, "percent": null}, "tweets": {"count": 25, "percent": 0.48}}, "example": {"date": "", "source": "newsletters", "text": "This guidebook which can be downloaded provides communities with detailed information of what to apply for, who to contact, and how to get ready to rebuild. This guidebook is a roadmap to the funding available under the law, as well as an explanatory document that shows, in as much detail as currently available, program-by-program information."}}, "foreign_policy": {"count": 406, "percent": 0.0049, "rank": 478.5, "sources": {"floor": {"count": 82, "percent": 0.0244}, "newsletters": {"count": 299, "percent": 0.0}, "statements": {"count": null, "percent": null}, "tweets": {"count": 25, "percent": 0.0}}, "example": {"date": "", "source": "tweets", "text": "Dr. Geeta Gupta spent her career empowering women worldwide. I'm glad the Senate has finally confirmed her to serve as Ambassador-at-large for Global Women’s Issues so she can continue her work improving women's economic security and combatting violence against women and girls."}}, "legislative_discussion": {"count": 406, "percent": 0.1773, "rank": 357.0, "sources": {"floor": {"count": 82, "percent": 0.1585}, "newsletters": {"count": 299, "percent": 0.1739}, "statements": {"count": null, "percent": null}, "tweets": {"count": 25, "percent": 0.28}}, "example": {"date": "", "source": "newsletters", "text": "Federal Communications Commission (FCC)- Affordable Connectivity Outreach Grant Program - Pilot Program Grants CFDA Number 32.011 provides new federal funding for the FCC to grant eligible governmental entities and third-party organizations with the funding and resources needed to increase awareness of and participation in the ACP among those households most in need of affordable connectivity. (January 9, 2023 deadline) Department of Interior- Fish and Wildlife Service National Fish Passage Program Bipartisan Infrastructure Law Fiscal Year 2023 and Fish and Wildlife Service F23AS00100 Refuges Enhancement/ Infrastructure CFDA Numbers 15.685 are two programs to maintain or increase fish populations to improve ecosystem resiliency and provide quality fishing experiences for the American people."}}}}