{"first_name": "Martin", "last_name": "Heinrich", "party": "Democrat", "state": "NM", "type": "sen", "twitter": "MartinHeinrich", "district": 0, "scorecard": {"blame": {"count": 629, "percent": 0.0223, "rank": 472.0, "sources": {"floor": {"count": 40, "percent": 0.0}, "newsletters": {"count": 527, "percent": 0.0114}, "statements": {"count": null, "percent": null}, "tweets": {"count": 62, "percent": 0.129}}, "example": {"date": "", "source": "newsletters", "text": "The overturning of Roe v. Wade came on top of a number of radical decisions from the Court in recent years, which include attacks on Tribal sovereignty and rollbacks of campaign finance laws and voting rights protections. It's clear that we must protect our rights from decisions made by the radical and out of touch MAGA majority on the Supreme Court."}}, "compromise": {"count": 629, "percent": 0.0302, "rank": 306.0, "sources": {"floor": {"count": 40, "percent": 0.0}, "newsletters": {"count": 527, "percent": 0.0304}, "statements": {"count": null, "percent": null}, "tweets": {"count": 62, "percent": 0.0484}}, "example": {"date": "", "source": "newsletters", "text": "I was also proud to be a part of the bipartisan group of senators who came together in the wake of tragedies in Uvalde, Texas and Buffalo, New York to find a meaningful path forward to pass the most significant law in nearly three decades to reduce gun violence and invest in public safety. The Bipartisan Safer Communities Act will increase access to mental health care, invest in proven school and community-based violence prevention programs, and keep guns out of the hands of those who pose a threat to themselves and their communities."}}, "credit_claiming": {"count": 629, "percent": 0.1733, "rank": 78.0, "sources": {"floor": {"count": 40, "percent": 0.125}, "newsletters": {"count": 527, "percent": 0.1727}, "statements": {"count": null, "percent": null}, "tweets": {"count": 62, "percent": 0.2097}}, "example": {"date": "", "source": "newsletters", "text": "That's why I worked to pass legislation providing certainty that the marriages of same-sex and interracial couples will not only be protected, but also given equal recognition across our nation. No American should have their rights and freedoms threatened because of who they are and whom they love."}}, "insult": {"count": 629, "percent": 0.0, "rank": 483.0, "sources": {"floor": {"count": 40, "percent": 0.0}, "newsletters": {"count": 527, "percent": 0.0}, "statements": {"count": null, "percent": null}, "tweets": {"count": 62, "percent": 0.0}}}, "example": null, "policy": {"count": 629, "percent": 0.4865, "rank": 253.0, "sources": {"floor": {"count": 40, "percent": 0.1}, "newsletters": {"count": 527, "percent": 0.5047}, "statements": {"count": null, "percent": null}, "tweets": {"count": 62, "percent": 0.5806}}, "example": {"date": "", "source": "newsletters", "text": "But I refuse to give up on preserving our hard-won and constitutional right to vote in free and fair elections and guaranteeing the right to privacy in health care decisions for every single American. Serving New Mexicans My office also continues to help constituents in New Mexico on a one-on-one basis when they are having trouble with federal agencies, including keeping our promise to our veterans and service members."}}, "foreign_policy": {"count": 629, "percent": 0.0032, "rank": 489.0, "sources": {"floor": {"count": 40, "percent": 0.0}, "newsletters": {"count": 527, "percent": 0.0038}, "statements": {"count": null, "percent": null}, "tweets": {"count": 62, "percent": 0.0}}, "example": {"date": "", "source": "newsletters", "text": "I immediately contacted then Secretary of State John Kerry and urged the US State Department to take all possible action to help repatriate the shield and other stolen cultural items. Thankfully, in the case of the Acoma shield, intense public outcry and diplomatic pressure were enough to prevent the illegal sale of cultural patrimony and return the item to the Pueblo."}}, "legislative_discussion": {"count": 629, "percent": 0.1876, "rank": 322.0, "sources": {"floor": {"count": 40, "percent": 0.05}, "newsletters": {"count": 527, "percent": 0.1954}, "statements": {"count": null, "percent": null}, "tweets": {"count": 62, "percent": 0.2097}}, "example": {"date": "", "source": "newsletters", "text": "That's why senators from both parties came together at the end of this year to pass bipartisan reforms to the Electoral Count Act and stronger security measures for nonpartisan local elections workers. Unfortunately, every single Senate Republican has chosen to use the filibuster to block us from even beginning debate on broader voting rights and campaign finance legislation and bills to codify Roe v. Wade ."}}}}