{"first_name": "Sheila", "last_name": "Jackson Lee", "party": "Democrat", "state": "TX", "type": "rep", "twitter": "JacksonLeeTX18", "district": 18, "scorecard": {"blame": {"count": 1418, "percent": 0.0917, "rank": 268.0, "sources": {"floor": {"count": 1339, "percent": 0.0956}, "newsletters": {"count": null, "percent": null}, "statements": {"count": 2, "percent": 0.0}, "tweets": {"count": 77, "percent": 0.026}}, "example": {"date": "", "source": "floor", "text": "I am asking the US Department of Education and President Biden to step in to protect school districts across America and to keep them from the political football that happens with Republican Governors who are attempting to make an example of these school districts. These children are brilliant."}}, "compromise": {"count": 1418, "percent": 0.0339, "rank": 276.5, "sources": {"floor": {"count": 1339, "percent": 0.0358}, "newsletters": {"count": null, "percent": null}, "statements": {"count": 2, "percent": 0.0}, "tweets": {"count": 77, "percent": 0.0}}, "example": {"date": "", "source": "floor", "text": "HR 347 would require the Administration to publish the inflationary impact of executive orders that are projected to have an annual budgetary effect of at least $1 billion. While I stand in strong opposition to this measure, I have offered five amendments, four of which were made in order, to HR 347 in order to help address the some of ambiguity and unnecessary oversight of presidential executive orders this bill unfortunately puts forth."}}, "credit_claiming": {"count": 1418, "percent": 0.031, "rank": 505.0, "sources": {"floor": {"count": 1339, "percent": 0.0291}, "newsletters": {"count": null, "percent": null}, "statements": {"count": 2, "percent": 0.0}, "tweets": {"count": 77, "percent": 0.0649}}, "example": {"date": "", "source": "floor", "text": "The executive orders that are well vetted by the President of the United States that have helped populations that have been in trouble, that have brought about a reckoning of police reform, these executive orders would not be interfered with under the pretense of trying to suggest an inflationary impact. Why not applaud the work that President Biden has done, as I said, with alleviating the debt of students and veterans, of which there are those now fighting this in the Supreme Court, the work he has done on climate change, and the work we have all done--Democrats and the President--to preserve Medicare, Social Security, and other critical programs?"}}, "insult": {"count": 1417, "percent": 0.0056, "rank": 282.5, "sources": {"floor": {"count": 1339, "percent": 0.006}, "newsletters": {"count": null, "percent": null}, "statements": {"count": 2, "percent": 0.0}, "tweets": {"count": 76, "percent": 0.0}}, "example": {"date": "", "source": "floor", "text": "They can learn. They are majority- minority, and they can learn."}}, "policy": {"count": 1418, "percent": 0.6333, "rank": 58.0, "sources": {"floor": {"count": 1339, "percent": 0.6482}, "newsletters": {"count": null, "percent": null}, "statements": {"count": 2, "percent": 0.0}, "tweets": {"count": 77, "percent": 0.3896}}, "example": {"date": "", "source": "tweets", "text": "Standing on the steps of the capitol for the commemoration of Mental Health Awareness Month. Now more than ever, it’s important that we preserve and build on the investments made in the American Rescue Plan to strengthen mental health care… [[url]]"}}, "foreign_policy": {"count": 1417, "percent": 0.0325, "rank": 318.0, "sources": {"floor": {"count": 1339, "percent": 0.0321}, "newsletters": {"count": null, "percent": null}, "statements": {"count": 2, "percent": 0.0}, "tweets": {"count": 76, "percent": 0.0395}}, "example": {"date": "", "source": "floor", "text": "It is important for the stability of that area, for the protection of women and children, and to save lives that at this time we do not withdraw our troops. Mr. Speaker, I ask my colleagues to oppose the underlying legislation and to respect the gentleman for the discussion that I think we should have."}}, "legislative_discussion": {"count": 1418, "percent": 0.3265, "rank": 61.0, "sources": {"floor": {"count": 1339, "percent": 0.3406}, "newsletters": {"count": null, "percent": null}, "statements": {"count": 2, "percent": 0.0}, "tweets": {"count": 77, "percent": 0.0909}}, "example": {"date": "", "source": "floor", "text": "Under the new regulation, fiduciaries may consider ``the economic effects of climate change and other environmental, social, or governance factors,'' but investment decisions ``may not subordinate the interests of the participants and beneficiaries in their retirement income or financial benefits under the plan to other objectives and may not sacrifice investment return or take on additional investment risk.'' This bill establishes the disapproval of the final rule ``Prudence and Loyalty in Selecting Plan Investments and Exercising Shareholder Rights.''"}}}}