{"first_name": "Tracey", "last_name": "Mann", "party": "Republican", "state": "KS", "type": "rep", "twitter": "RepMann", "district": 1, "scorecard": {"blame": {"count": 1378, "percent": 0.0559, "rank": 362.0, "sources": {"floor": {"count": 83, "percent": 0.1325}, "newsletters": {"count": 1275, "percent": 0.051}, "statements": {"count": 20, "percent": 0.05}, "tweets": {"count": null, "percent": null}}, "example": {"date": "", "source": "newsletters", "text": "ICYMI: Voting Against Sixth Short-Term Continuing Resolution Members of the House are on their way back to Washington, DC this week because Washington Democrats have once again failed to fulfill their obligation of passing an annual budget for our government. Last week's vote on a sixth short-term continuing resolution in two years is no way to fund a government."}}, "compromise": {"count": 1378, "percent": 0.0102, "rank": 478.0, "sources": {"floor": {"count": 83, "percent": 0.012}, "newsletters": {"count": 1275, "percent": 0.0102}, "statements": {"count": 20, "percent": 0.0}, "tweets": {"count": null, "percent": null}}, "example": {"date": "", "source": "newsletters", "text": "America needs a tailored, well-maintained, fiscally responsible infrastructure network to support economic activity, strengthen our supply chain, and remain a global power. I look forward to working with my fellow committee members to do just that."}}, "credit_claiming": {"count": 1378, "percent": 0.0486, "rank": 451.0, "sources": {"floor": {"count": 83, "percent": 0.0723}, "newsletters": {"count": 1275, "percent": 0.0471}, "statements": {"count": 20, "percent": 0.05}, "tweets": {"count": null, "percent": null}}, "example": {"date": "", "source": "newsletters", "text": "Read about the legislation that I co-sponsor: HR 2660, the Withstanding Attempts to Encroach on our Resources (WATER) Act. In the Office Rep. Mann Co-introduces Bicameral Measure to Prevent Lesser Prairie-Chicken Listing I refuse to sit idly by while the United States Fish and Wildlife Service imposes burdensome regulations on producers with no input from Congress."}}, "insult": {"count": 1378, "percent": 0.0007, "rank": 390.5, "sources": {"floor": {"count": 83, "percent": 0.012}, "newsletters": {"count": 1275, "percent": 0.0}, "statements": {"count": 20, "percent": 0.0}, "tweets": {"count": null, "percent": null}}, "example": {"date": "", "source": "floor", "text": "I am here to do my part in making America stronger. We need to rebuild our country on behalf of Americans who have had their rights stripped from them, their taxpayer dollars wasted, their values shoved back in their face, and their country's economy brought to the brink of disaster by an administration that isn't getting the message."}}, "policy": {"count": 1378, "percent": 0.4122, "rank": 374.0, "sources": {"floor": {"count": 83, "percent": 0.4578}, "newsletters": {"count": 1275, "percent": 0.4039}, "statements": {"count": 20, "percent": 0.75}, "tweets": {"count": null, "percent": null}}, "example": {"date": "", "source": "newsletters", "text": "Rather than passing an annual budget that provides certainty, Washington Democrats chose to pass a week-long extension to buy more time for them to gift Americans another multi-trillion dollar spending package right before the holidays. With record-high inflation and a national debt approaching $32 trillion, Congress should have an open and constructive debate on our nation's finances."}}, "foreign_policy": {"count": 1378, "percent": 0.0261, "rank": 352.0, "sources": {"floor": {"count": 83, "percent": 0.012}, "newsletters": {"count": 1275, "percent": 0.0275}, "statements": {"count": 20, "percent": 0.0}, "tweets": {"count": null, "percent": null}}, "example": {"date": "", "source": "newsletters", "text": "Last year, while Americans faced skyrocketing prices at the pump, President Biden's Department of Energy sold more than one million barrels of oil from our Strategic Petroleum Reserve (SPR) to a Chinese Communist Party-affiliated company . Under the Biden Administration, the SPR has been depleted by 36% to its lowest level since 198 4 ."}}, "legislative_discussion": {"count": 1378, "percent": 0.2119, "rank": 241.0, "sources": {"floor": {"count": 83, "percent": 0.1446}, "newsletters": {"count": 1275, "percent": 0.2157}, "statements": {"count": 20, "percent": 0.25}, "tweets": {"count": null, "percent": null}}, "example": {"date": "", "source": "newsletters", "text": "Read the full text of the legislation here. Read a few of the letters that I have sent with my colleagues opposing federal overreach in other mandatory conservation efforts: Letter to the US Fish and Wildlife Service Letter to the US Department of Interior Secretary Deb Haaland See additional legislation that I have supported that opposes the endangered species listing of the Lesser Prairie-Chicken: HR 4370, the Listing Reform Act Watch my Floor Speech about the Lesser Prairie-Chicken."}}}}