{"first_name": "Roger", "last_name": "Marshall", "party": "Republican", "state": "KS", "type": "sen", "twitter": "SenatorMarshall", "district": 0, "senate_class": 2, "facebook": null, "website": "https://www.marshall.senate.gov", "contact": "https://www.marshall.senate.gov/contact/", "birthday": "1960-08-09", "serving_congress_since": "2017-01-03", "serving_current_chamber_since": "2021-01-03", "scorecard": {"blame": {"count": 656, "percent": 0.157, "rank": 125.0, "sources": {"floor": {"count": 176, "percent": 0.1932}, "newsletters": {"count": 480, "percent": 0.1438}, "statements": {"count": null, "percent": null}, "tweets": {"count": null, "percent": null}}, "example": {"date": "", "source": "newsletters", "text": "In our letter to Silvergate CEO Alan Lane, we wrote, \"your bank's involvement in the transfer of FTX customer funds to Alameda reveals what appears to be an egregious failure of your bank's responsibility to monitor for and report suspicious financial activity carried out by its clients. The public is owed a full accounting of the financial activities that may have led to the loss of billions in customer assets, and any role that Silvergate may have played in these losses.\""}}, "compromise": {"count": 656, "percent": 0.0305, "rank": 302.5, "sources": {"floor": {"count": 176, "percent": 0.0}, "newsletters": {"count": 480, "percent": 0.0417}, "statements": {"count": null, "percent": null}, "tweets": {"count": null, "percent": null}}, "example": {"date": "", "source": "newsletters", "text": "My bipartisan, bicameral legislation modernizes the way Medicare Advantage plans and health care providers use prior authorization, and in turn improves the timely access to care for America's seniors. Since its introduction, advocacy organizations that represent patients, physicians, hospitals, and other key stakeholders in the health care industry have officially endorsed the legislation."}}, "credit_claiming": {"count": 656, "percent": 0.0503, "rank": 447.0, "sources": {"floor": {"count": 176, "percent": 0.0341}, "newsletters": {"count": 480, "percent": 0.0563}, "statements": {"count": null, "percent": null}, "tweets": {"count": null, "percent": null}}, "example": {"date": "", "source": "newsletters", "text": "There's a reason why the Improving Seniors' Timely Access to Care Act is one of the most popular healthcare bills this Congress. I'm grateful for all the hard work that has gone into creating significant momentum for this bill - for it is this hard work that brings us closer to getting this over the finish line before the new Congress."}}, "insult": {"count": 656, "percent": 0.0259, "rank": 101.0, "sources": {"floor": {"count": 176, "percent": 0.0625}, "newsletters": {"count": 480, "percent": 0.0125}, "statements": {"count": null, "percent": null}, "tweets": {"count": null, "percent": null}}, "example": {"date": "", "source": "newsletters", "text": "We also don't need to settle for the total and complete failure from the weakest, most incompetent Homeland Security Secretary our nation has ever seen. Alejandro Mayorkas better have a good explanation for his role in this mess should he come before the Committee in the Senate."}}, "policy": {"count": 656, "percent": 0.5335, "rank": 163.0, "sources": {"floor": {"count": 176, "percent": 0.3523}, "newsletters": {"count": 480, "percent": 0.6}, "statements": {"count": null, "percent": null}, "tweets": {"count": null, "percent": null}}, "example": {"date": "", "source": "newsletters", "text": "1 physician and administrative concern in America,' senator says Sunflower State Journal: Lawmaker elected Farm Bureau president FOX Kansas City: Kansas City family battling RSV during medicine shortage Daily Caller: Here's How The CDC Used A Backchannel With Twitter To Control The COVID-19 Narrative Breitbart: Border Patrol Agent Dies on Duty in Texas CNN: Hospitals in the US are the fullest they've been throughout the pandemic - but it's not just Covid Wall Street Journal: TikTok National-Security Deal Faces More Delays as Worry Grows Over Risks Agri-Pulse: Citing Cancer Moonshot effort, USDA rolls out new nutrition initiative The Hill: It's simple math: We need immigration reform now Politico: Ronna McDaniel set to get new opponent for RNC post Fox News: College degree value plummets as woke insanity spikes (Fox News) Topeka 800 SW Jackson Street, Suite 600 Topeka, KS 66612 Phone: 785-414-7501 Overland Park 7011 W 121st Street, Suite 100 Overland Park, KS 66209 Phone: 913-879-7070 Pittsburg 402B North Broadway Pittsburg, KS 66762 Phone: 620-404-7016 Salina 204 S Santa Fe Avenue, Suite 1 Salina, KS 67401 Phone: 785-829-9000 Garden City 921 Lareu Street, Suite C Garden City, KS 67846 Phone: 620-765-7800 Wichita 100 S Market, Suite 102 Wichita, KS 67202 Phone: 316-803-6120 Washington DC Russell Senate Office Building Suite 479A Washington, DC 20510 Phone: 202-224-4774"}}, "foreign_policy": {"count": 656, "percent": 0.0213, "rank": 376.0, "sources": {"floor": {"count": 176, "percent": 0.0057}, "newsletters": {"count": 480, "percent": 0.0271}, "statements": {"count": null, "percent": null}, "tweets": {"count": null, "percent": null}}, "example": {"date": "", "source": "newsletters", "text": "At least $150 million of that must go to Jordan, according to the bill. $575 million in a global health section allocated for \"family planning/reproductive health, including in areas where population growth threatens biodiversity or endangered species.\""}}, "legislative_discussion": {"count": 656, "percent": 0.2332, "rank": 195.0, "sources": {"floor": {"count": 176, "percent": 0.108}, "newsletters": {"count": 480, "percent": 0.2792}, "statements": {"count": null, "percent": null}, "tweets": {"count": null, "percent": null}}, "example": {"date": "", "source": "newsletters", "text": "The Steeles are just one of about 69 different Christmas tree farms located in Kansas, and one of the over 400 registered agritourism businesses in the state offering unique on-farm experiences. CBS Wichita: Sen. Bob Dole remembered with inaugural day of service Kansas Reflector: Kansas congressman introduces bill to block federal listing of lesser prairie chicken KCLY: Sen. Marshall Completes 105 Town Hall Circuit Across Kansas Salina Post: Marshall: 2023 NDAA eliminates COVID vaxx mandate for military Lawrence Journal World: 'It is killing people': The fentanyl crisis in Lawrence is on the rise and 'it's everywhere in the city' (Lawrence Journal-World) Wall Street Journal: Lawmakers Want Answers From Silvergate About FTX Transfers Inside Health Policy: Sen. Marshall: Congress Will Tackle Medicaid Prior Authorization Next New York Post: House to repeal military COVID-19 vax mandate in defense bill AgriPulse: Sen. Roger Marshall on FDA report, contract library, 2023 farm bill USA Today: 'In desperate need': Moms still search frantically for baby formula months after shortage Becker's Payer Issues: Prior authorization is 'No."}}}}