{"first_name": "Ayanna", "last_name": "Pressley", "party": "Democrat", "state": "MA", "type": "rep", "twitter": "RepPressley", "district": 7, "senate_class": 0, "facebook": null, "website": "https://pressley.house.gov", "contact": null, "birthday": "1974-02-03", "serving_congress_since": "2019-01-03", "serving_current_chamber_since": "2019-01-03", "scorecard": {"blame": {"count": 1787, "percent": 0.1108, "rank": 212.0, "sources": {"floor": {"count": 55, "percent": 0.1455}, "newsletters": {"count": 65, "percent": 0.0308}, "statements": {"count": 1622, "percent": 0.1091}, "tweets": {"count": 45, "percent": 0.2444}}, "example": {"date": "", "source": "tweets", "text": "Republicans, once again, making history for all the wrong reasons. [[url]]"}}, "compromise": {"count": 1796, "percent": 0.0084, "rank": 490.5, "sources": {"floor": {"count": 55, "percent": 0.0}, "newsletters": {"count": 65, "percent": 0.0}, "statements": {"count": 1631, "percent": 0.0092}, "tweets": {"count": 45, "percent": 0.0}}, "example": {"date": "", "source": "statements", "text": "In addition to Pressley, Dean, Spanberger, García, Bush and Kamlager-Dove, the resolution is co-sponsored by Reps. Doris Matsui, Suzanne Bonamici, William R Keating, Mike Quigley, Sanford Bishop, Sara Jacobs, Debbie Wasserman Schultz, John P Sarbanes, Seth Moulton, Gregorio Kilili Camacho Sablan, Shri Thanedar, Scott Peters, Betty McCollum, Jerrold Nadler, Ritchie Torres, Gerald E Connolly, Troy A Carter, Sr., Lloyd Doggett, Adam Schiff, Danny K Davis, Rick Larsen, David Trone, Suzan DelBene, Eric Swalwell, Robin L Kelly, André Carson, Barbara Lee, Sheila Jackson Lee, Jimmy Panetta, Rashida Tlaib, Mark DeSaulnier, Derek Kilmer, Jake Auchincloss, Jamie Raskin, Julia Brownley, Kathy Castor, Rep. Matt Cartwright, Greg Stanton, Joyce Beatty, Yvette D Clarke, John Garamendi, Lori Trahan, Nikema Williams, Adriano Espaillat, Chellie Pingree, Jim Costa, Eleanor Holmes Norton, Jan Schakowsky, Nanette Diaz Barragán, Jesús G “Chuy” García, Jimmy Gomez, Salud Carbajal, Daniel T Kildee, Jill Tokuda, Mark Pocan, Bonnie Watson Coleman, Earl Blumenauer, Joe Neguse, Raja Krishnamoorthi, James P McGovern, Joseph Morelle, Henry Cuellar, Ami Bera, MD, Donald S Beyer Jr., Chrissy Houlahan, Rep. Stephen F Lynch, Alexandria Ocasio -Cortez, Dina Titus, Lois Frankel, Mark Takano, Chellie Pingree, Kweisi Mfume, Chris Deluzio, Val Hoyle, Dean Phillips, Katie Porter, Brittany Pettersen, Colin Allred, Nikema Williams, Bill Pacrell Jr., Pramila Jayapal, Al Green, Mike Levin, Jennifer Wexton, Lauren Underwood, Angie Craig, Hank Johnson, Danny K Davis, Robert Garcia, Dwight Evans, Ruben Gallego, Brendan Boyle, Frederica S Wilson, Frank Pallone, Jesús “Chuy” García, Lizzie Fletcher, Darren Soto, Linda T Sánchez, Judy Chu, Susie Lee, Madeleine Dean, Tony Cardenas, Nydia M Velázquez, Sheila Cherfilus-McCormick, Gwen Moore, Donald M Payne, Jr., Grace Meng, Alma S Adams, Ph.D, Debbie Dingell, Kathy Manning, Sean Casten, Mary Gay Scanlon, Lisa Blunt Rochester, Susan Wild, Kim Schrier, Norma J Torres, Elissa Slotkin, Marc Veasey, Marcy Kaptur, Jared Golden, Haley Stevens, Deborah K Ross, Andy Kim, Rosa DeLauro, Becca Balint, Jamaal Bowman, Nydia M Velazquez, Jason Crow, Shontel Brown, Jahana Hayes, Kevin Mullin, Pete Aguilar, Chris Pappas, and Ilhan Omar. In addition to Cardin, Murkowski, Durbin and Hirono, S J Res. 4 is cosponsored by Senators Chuck Schumer (D-NY), Richard Blumenthal (D-Conn."}}, "credit_claiming": {"count": 1824, "percent": 0.0691, "rank": 363.5, "sources": {"floor": {"count": 55, "percent": 0.0727}, "newsletters": {"count": 65, "percent": 0.1385}, "statements": {"count": 1659, "percent": 0.0669}, "tweets": {"count": 45, "percent": 0.0444}}, "example": {"date": "", "source": "newsletters", "text": "That's why I'm so encouraged by the progress we've made this year to boost mental health support for survivors of natural disasters, terrorist attacks and other tragedies; end race-based hair discrimination ; honor survivors of homicide victims nationwide; help grandfamilies access affordable and age-appropriate housing; expand access to treatment for folks suffering from Long COVID ; address the credit issues faced by trans and nonbinary folks who legally change their names ; and more. Each of these bills was developed with and informed by those most impacted."}}, "insult": {"count": 1787, "percent": 0.0229, "rank": 115.0, "sources": {"floor": {"count": 55, "percent": 0.0182}, "newsletters": {"count": 65, "percent": 0.0}, "statements": {"count": 1622, "percent": 0.0222}, "tweets": {"count": 45, "percent": 0.0889}}, "example": {"date": "", "source": "tweets", "text": "Republicans, once again, making history for all the wrong reasons. [[url]]"}}, "policy": {"count": 1824, "percent": 0.6014, "rank": 78.5, "sources": {"floor": {"count": 55, "percent": 0.6182}, "newsletters": {"count": 65, "percent": 0.3538}, "statements": {"count": 1659, "percent": 0.607}, "tweets": {"count": 45, "percent": 0.7333}}, "example": {"date": "", "source": "tweets", "text": "Passengers shouldn’t be on the hook for food, hotels & other costs when airlines screw up. I'm glad [[user]] is taking action to protect consumers & require airlines to compensate passengers when there are preventable delays or cancellations. [[url]]"}}, "foreign_policy": {"count": 1824, "percent": 0.0121, "rank": 434.0, "sources": {"floor": {"count": 55, "percent": 0.0}, "newsletters": {"count": 65, "percent": 0.0}, "statements": {"count": 1659, "percent": 0.0133}, "tweets": {"count": 45, "percent": 0.0}}, "example": {"date": "", "source": "statements", "text": "Her work in Congress is needed on the Foreign Affairs Committee. Her clarity, conviction, and truth."}}, "legislative_discussion": {"count": 1824, "percent": 0.2977, "rank": 98.0, "sources": {"floor": {"count": 55, "percent": 0.1273}, "newsletters": {"count": 65, "percent": 0.0923}, "statements": {"count": 1659, "percent": 0.3128}, "tweets": {"count": 45, "percent": 0.2444}}, "example": {"date": "", "source": "tweets", "text": "Every branch of our government has a code of ethics—except the Supreme Court. It’s time we pass an binding code of ethics for Supreme Court justices."}}}}