{"first_name": "Bradley", "last_name": "Schneider", "party": "Democrat", "state": "IL", "type": "rep", "twitter": "RepSchneider", "district": 10, "scorecard": {"blame": {"count": 1815, "percent": 0.0303, "rank": 442.5, "sources": {"floor": {"count": 62, "percent": 0.0806}, "newsletters": {"count": 943, "percent": 0.0286}, "statements": {"count": 786, "percent": 0.0293}, "tweets": {"count": 24, "percent": 0.0}}, "example": {"date": "", "source": "newsletters", "text": "Later, several of the Members who had been trapped in the Gallery during the attack, and ultimately rescued by the Capitol Police, hosted a lunch to thank the people who protect us day in and day out. The January 6 Committee Report - The Threat Remains Even though the January 6th Committee has been dissolved, its investigation and report demonstrated with stunning clarity that: (1) the attack was not a spontaneous uprising, and (2) President Trump was willfully and directly responsible for the events that led to and inspired the chaos and bloodshed that day."}}, "compromise": {"count": 1815, "percent": 0.0661, "rank": 118.5, "sources": {"floor": {"count": 62, "percent": 0.129}, "newsletters": {"count": 943, "percent": 0.0615}, "statements": {"count": 786, "percent": 0.0649}, "tweets": {"count": 24, "percent": 0.125}}, "example": {"date": "", "source": "newsletters", "text": "Family is a value we can all support, regardless of political affiliation. I hope that my work with former Senator Kirk will make families in the tenth district even stronger."}}, "credit_claiming": {"count": 1815, "percent": 0.0711, "rank": 352.0, "sources": {"floor": {"count": 62, "percent": 0.0968}, "newsletters": {"count": 943, "percent": 0.07}, "statements": {"count": 786, "percent": 0.0687}, "tweets": {"count": 24, "percent": 0.125}}, "example": {"date": "", "source": "newsletters", "text": "The package includes funding for 10th District projects, funding to protect children enrolled in Medicaid and CHIP, and language to reform the Electoral Count Act. All 15 of the Tenth District's Community Project Funding (CPF) submissions were included in the legislation, as were bills I introduced to improve retirement security and a provision supporting telemedicine."}}, "insult": {"count": 1815, "percent": 0.0011, "rank": 382.5, "sources": {"floor": {"count": 62, "percent": 0.0}, "newsletters": {"count": 943, "percent": 0.0011}, "statements": {"count": 786, "percent": 0.0013}, "tweets": {"count": 24, "percent": 0.0}}, "example": {"date": "", "source": "newsletters", "text": "McCarthy's amended bill attacks the health care of our service members, denigrates huge swaths of our country's citizens, and will make our military less ready and less capable for the future. As the representative for every Navy recruit and Vice-Chair of the New Democrat Coalition, I could not in good conscience vote for such a dreadful, disingenuous, and dangerous bill."}}, "policy": {"count": 1815, "percent": 0.3146, "rank": 488.0, "sources": {"floor": {"count": 62, "percent": 0.6452}, "newsletters": {"count": 943, "percent": 0.3022}, "statements": {"count": 786, "percent": 0.299}, "tweets": {"count": 24, "percent": 0.4583}}, "example": {"date": "", "source": "newsletters", "text": "You can the full announcement of the bill here . RESOURCES TO HELP YOU AND YOUR COMMUNITY Please visit my website to find resources for the following services, and more: Affordable Internet Connectivity Program Smart 9-1-1 9-8-8 Suicide and Crisis Lifeline, 9-8-8 for Veterans Maternal Mental Health Hotline Uniting for Ukraine Unincorporated Residents Eligible for Flood Insurance Premium Discounts Ride Lake County CONTACT MY OFFICE As always, I want to hear from you."}}, "foreign_policy": {"count": 1815, "percent": 0.0959, "rank": 99.0, "sources": {"floor": {"count": 62, "percent": 0.2742}, "newsletters": {"count": 943, "percent": 0.088}, "statements": {"count": 786, "percent": 0.0916}, "tweets": {"count": 24, "percent": 0.0833}}, "example": {"date": "", "source": "newsletters", "text": "Last spring, Congress passed legislation funding all 10 of our district's 2022 Community Project Funding Requests, addressing local needs such as mental health, flooding, food insecurity, and economic development The spring funding bill also included my Israel Relations Normalization Act supporting the historic Abraham Accords between United Arab Emirates, Bahrain, In June, we passed the Chips & Science Act bringing critical semiconductor manufacturing back to the United States and investing to ensure US technological leadership well into the future We also passed the PACT Act supporting our veterans and in particular providing health care to individuals exposed to toxic burn pits. June wrapped up with House passage of the Respect for Marriage Act, protecting marriage equality for all Americans."}}, "legislative_discussion": {"count": 1815, "percent": 0.1355, "rank": 451.0, "sources": {"floor": {"count": 62, "percent": 0.3065}, "newsletters": {"count": 943, "percent": 0.1368}, "statements": {"count": 786, "percent": 0.1209}, "tweets": {"count": 24, "percent": 0.125}}, "example": {"date": "", "source": "newsletters", "text": "However, there need to be more opportunities for established teachers. The Teachers Are Leaders Act would expand TQP grants by making \"teacher leader\" programs focused on professional development for established teachers eligible for funding."}}}}