{"first_name": "Bradley", "last_name": "Schneider", "party": "Democrat", "state": "IL", "type": "rep", "twitter": "RepSchneider", "district": 10, "senate_class": 0, "facebook": "CongressmanBradSchneider", "website": "https://schneider.house.gov", "contact": null, "birthday": "1961-08-20", "serving_congress_since": "2013-01-03", "serving_current_chamber_since": "2013-01-03", "scorecard": {"blame": {"count": 1815, "percent": 0.0303, "rank": 442.5, "sources": {"floor": {"count": 62, "percent": 0.0806}, "newsletters": {"count": 943, "percent": 0.0286}, "statements": {"count": 786, "percent": 0.0293}, "tweets": {"count": 24, "percent": 0.0}}, "example": {"date": "", "source": "newsletters", "text": "Later, several of the Members who had been trapped in the Gallery during the attack, and ultimately rescued by the Capitol Police, hosted a lunch to thank the people who protect us day in and day out. The January 6 Committee Report - The Threat Remains Even though the January 6th Committee has been dissolved, its investigation and report demonstrated with stunning clarity that: (1) the attack was not a spontaneous uprising, and (2) President Trump was willfully and directly responsible for the events that led to and inspired the chaos and bloodshed that day."}}, "compromise": {"count": 1815, "percent": 0.0661, "rank": 118.5, "sources": {"floor": {"count": 62, "percent": 0.129}, "newsletters": {"count": 943, "percent": 0.0615}, "statements": {"count": 786, "percent": 0.0649}, "tweets": {"count": 24, "percent": 0.125}}, "example": {"date": "", "source": "newsletters", "text": "Here's my quote from the press release announcing our election: \"For more than 25 years, The New Democrat Coalition has been a driving force for crafting smart legislation and advancing the interests of the American People,\" said NDC Vice Chair-elect for Communications Brad Schneider . \"As Vice Chair, I am excited to help lead the New Dems as we continue our work to grow our economy, tackle climate change, and move our country forward by reaching across our Democratic Caucus and across the aisle."}}, "credit_claiming": {"count": 1815, "percent": 0.0711, "rank": 352.0, "sources": {"floor": {"count": 62, "percent": 0.0968}, "newsletters": {"count": 943, "percent": 0.07}, "statements": {"count": 786, "percent": 0.0687}, "tweets": {"count": 24, "percent": 0.125}}, "example": {"date": "", "source": "newsletters", "text": "You can read the full text here . Veteran Service Recognition Act I helped pass this legislation to establish and codify several procedures to help expedite the naturalization process for non-US citizens serving in the US military."}}, "insult": {"count": 1815, "percent": 0.0011, "rank": 382.5, "sources": {"floor": {"count": 62, "percent": 0.0}, "newsletters": {"count": 943, "percent": 0.0011}, "statements": {"count": 786, "percent": 0.0013}, "tweets": {"count": 24, "percent": 0.0}}, "example": {"date": "", "source": "newsletters", "text": "McCarthy's amended bill attacks the health care of our service members, denigrates huge swaths of our country's citizens, and will make our military less ready and less capable for the future. As the representative for every Navy recruit and Vice-Chair of the New Democrat Coalition, I could not in good conscience vote for such a dreadful, disingenuous, and dangerous bill."}}, "policy": {"count": 1815, "percent": 0.3146, "rank": 488.0, "sources": {"floor": {"count": 62, "percent": 0.6452}, "newsletters": {"count": 943, "percent": 0.3022}, "statements": {"count": 786, "percent": 0.299}, "tweets": {"count": 24, "percent": 0.4583}}, "example": {"date": "", "source": "newsletters", "text": "RESOURCES TO HELP YOU AND YOUR COMMUNITY Please visit my website to find resources for the following services, and more: Affordable Internet Connectivity Program Smart 9-1-1 9-8-8 Suicide and Crisis Lifeline, 9-8-8 for Veterans Maternal Mental Health Hotline Uniting for Ukraine Unincorporated Residents Eligible for Flood Insurance Premium Discounts Ride Lake County CONTACT MY OFFICE As always, I want to hear from you. Please Email Me on my website or call my DC office at (202) 225-4835 if you'd like to share your thoughts on any matter."}}, "foreign_policy": {"count": 1815, "percent": 0.0959, "rank": 99.0, "sources": {"floor": {"count": 62, "percent": 0.2742}, "newsletters": {"count": 943, "percent": 0.088}, "statements": {"count": 786, "percent": 0.0916}, "tweets": {"count": 24, "percent": 0.0833}}, "example": {"date": "", "source": "newsletters", "text": "WHAT'S HAPPENING IN WASHINGTON Abraham Accords: N7 Conference in Morocco Last Wednesday I was honored to address the N7 Conference on Education and Coexistence in Rabat, Morocco, albeit by prerecorded video . The N7 Initiative, sponsored by the Atlantic Council and the Jeffrey M Talpins Foundation, is a program to build on the Abraham Accords and foster further normalization between Israel and Arab and Muslim countries."}}, "legislative_discussion": {"count": 1815, "percent": 0.1355, "rank": 451.0, "sources": {"floor": {"count": 62, "percent": 0.3065}, "newsletters": {"count": 943, "percent": 0.1368}, "statements": {"count": 786, "percent": 0.1209}, "tweets": {"count": 24, "percent": 0.125}}, "example": {"date": "", "source": "newsletters", "text": "Additionally, this legislation will reduce wait times for employment-based green card applications and address immigration backlogs for highly skilled workers who want to work in the United States. You can read the full text of the bill here ."}}}}