{"first_name": "Bennie", "last_name": "Thompson", "party": "Democrat", "state": "MS", "type": "rep", "twitter": "BennieGThompson", "district": 2, "scorecard": {"blame": {"count": 284, "percent": 0.0387, "rank": 418.0, "sources": {"floor": {"count": 235, "percent": 0.0426}, "newsletters": {"count": null, "percent": null}, "statements": {"count": 40, "percent": 0.0}, "tweets": {"count": 9, "percent": 0.1111}}, "example": {"date": "", "source": "floor", "text": "The hearing was the culmination of an 18-month investigation into how the Coast Guard mishandled Commander Young-McLear's allegations of harassment and bullying based in part on her race, gender, and sexual orientation and failed to protect her from prohibited retaliation. The hearing, along with the issuance of a joint staff report on the results of the investigation, prompted the Coast Guard to implement several recommendations to improve its anti-harassment policies, investigative processes, and civil rights manual."}}, "compromise": {"count": 284, "percent": 0.007, "rank": 498.0, "sources": {"floor": {"count": 235, "percent": 0.0085}, "newsletters": {"count": null, "percent": null}, "statements": {"count": 40, "percent": 0.0}, "tweets": {"count": 9, "percent": 0.0}}, "example": {"date": "", "source": "floor", "text": "The Administration looks forward to working with the Congress to address the Administration's concerns with this legislation, a number of which are outlined below. Protection of Aviation Consumer Rights and Promotion of Competition."}}, "credit_claiming": {"count": 284, "percent": 0.0106, "rank": 547.0, "sources": {"floor": {"count": 235, "percent": 0.0128}, "newsletters": {"count": null, "percent": null}, "statements": {"count": 40, "percent": 0.0}, "tweets": {"count": 9, "percent": 0.0}}, "example": {"date": "", "source": "floor", "text": "One of Waikinya's professional accomplishments is helping to direct nearly $1.5 million in funds to nonprofit organizations who were looking to help educate and strengthen engagement of communities in electoral politics, to help train women to skillfully assume elected office and empower and influence them to disrupt politics on a local, state, and federal level. Previously, Clanton has served as senior adviser to the Democratic National Committee chair."}}, "insult": {"count": 284, "percent": 0.0141, "rank": 170.0, "sources": {"floor": {"count": 235, "percent": 0.017}, "newsletters": {"count": null, "percent": null}, "statements": {"count": 40, "percent": 0.0}, "tweets": {"count": 9, "percent": 0.0}}, "example": {"date": "", "source": "floor", "text": "The disgraced ex-President even stored some of the Nation's most sensitive secrets in the bathroom of his Florida club. These attempts to censure Adam have been orchestrated to distract, but no one is fooled."}}, "policy": {"count": 284, "percent": 0.1725, "rank": 551.0, "sources": {"floor": {"count": 235, "percent": 0.166}, "newsletters": {"count": null, "percent": null}, "statements": {"count": 40, "percent": 0.2}, "tweets": {"count": 9, "percent": 0.2222}}, "example": {"date": "", "source": "tweets", "text": "NEW: [[user]], [[user]], [[user]] & [[user]] announce creation of the Disaster Equity & Building Resilience Caucus to learn more about how Congress can make disaster outcomes more equitable and make communities stronger. [[url]]"}}, "foreign_policy": {"count": 284, "percent": 0.007, "rank": 464.5, "sources": {"floor": {"count": 235, "percent": 0.0085}, "newsletters": {"count": null, "percent": null}, "statements": {"count": 40, "percent": 0.0}, "tweets": {"count": 9, "percent": 0.0}}, "example": {"date": "", "source": "floor", "text": "While the Administration appreciates the language aimed at ensuring continued US implementation of Open Skies agreements while promoting labor standards for US-based aviation sector workers, the Administration also urges the Congress to add provisions to implement US international commitments and ensure our aviation partners follow suit. The bill should be amended to include provisions for US implementation of global market- based measures of the International Civil Aviation Organization, and to establish US leadership relating to the understanding and mitigation of the non-Greenhouse Gas climate impacts of aviation."}}, "legislative_discussion": {"count": 284, "percent": 0.1232, "rank": 478.0, "sources": {"floor": {"count": 235, "percent": 0.1149}, "newsletters": {"count": null, "percent": null}, "statements": {"count": 40, "percent": 0.2}, "tweets": {"count": 9, "percent": 0.0}}, "example": {"date": "", "source": "floor", "text": "Mr. Speaker, I rise to honor the inaugural class of the Department of Homeland Security (DHS)'s Intelligence and Cybersecurity Diversity Fellowship (ICDF) Program. The ICDF program, authorized in the Intelligence Authorization Act for Fiscal Year 2021, is targeted at helping DHS cultivate diverse talent to join the ranks of its intelligence and cybersecurity offices and components, including the Office of Intelligence and Analysis and the Cybersecurity and Infrastructure Security Agency."}}}}