{"first_name": "Daniel", "last_name": "Webster", "party": "Republican", "state": "FL", "type": "rep", "twitter": "RepWebster", "district": 11, "scorecard": {"blame": {"count": 977, "percent": 0.0655, "rank": 330.0, "sources": {"floor": {"count": null, "percent": null}, "newsletters": {"count": 942, "percent": 0.0616}, "statements": {"count": 14, "percent": 0.2143}, "tweets": {"count": 21, "percent": 0.1429}}, "example": {"date": "", "source": "tweets", "text": "#BidenBorderCrisis is getting worse because the President has refused to take proper action. The first step to immigration reform must be securing our borders, and HR 2 will do that. [[url]]"}}, "compromise": {"count": 977, "percent": 0.0164, "rank": 407.0, "sources": {"floor": {"count": null, "percent": null}, "newsletters": {"count": 942, "percent": 0.017}, "statements": {"count": 14, "percent": 0.0}, "tweets": {"count": 21, "percent": 0.0}}, "example": {"date": "", "source": "newsletters", "text": "I look forward to working with Chairman Sam Graves in the Transportation and Infrastructure Committee to bring about creative funding ideas and innovative programs to invest in our Infrastructure, and with Chairman Bruce Westerman in the Natural Resources committee to protect and preserve Florida's natural resources while working to solve the many crisis our country is facing. FAA Accountability Following the FAA's system meltdown last week, both Chair Graves and I called on and FAA leaders to provide us a full briefing on what went wrong, steps being taken to prevent future occurrences and accountability for the massive disruption cause to Americans across the country."}}, "credit_claiming": {"count": 978, "percent": 0.1176, "rank": 193.5, "sources": {"floor": {"count": null, "percent": null}, "newsletters": {"count": 942, "percent": 0.1136}, "statements": {"count": 15, "percent": 0.0}, "tweets": {"count": 21, "percent": 0.381}}, "example": {"date": "", "source": "newsletters", "text": "The constituent contacted my office as the change still had not been processed after 6 months. After my staff submitted an inquiry, the VA processed the name change."}}, "insult": {"count": 977, "percent": 0.002, "rank": 368.5, "sources": {"floor": {"count": null, "percent": null}, "newsletters": {"count": 942, "percent": 0.0021}, "statements": {"count": 14, "percent": 0.0}, "tweets": {"count": 21, "percent": 0.0}}, "example": {"date": "", "source": "newsletters", "text": "Even President Obama and then Vice President Biden were aware and failed to hold anyone accountable. I have long called for accountability for the actions of corrupt individuals, those that perpetrated this hoax should go to jail."}}, "policy": {"count": 978, "percent": 0.4039, "rank": 386.0, "sources": {"floor": {"count": null, "percent": null}, "newsletters": {"count": 942, "percent": 0.3907}, "statements": {"count": 15, "percent": 0.9333}, "tweets": {"count": 21, "percent": 0.619}}, "example": {"date": "", "source": "newsletters", "text": "I have and will continue to advocate to bring reform to the VA to ensure our veterans get the care they have earned. If your application for veteran benefits or services have been delayed and you need assistance with getting a response from the VA, please contact my office."}}, "foreign_policy": {"count": 978, "percent": 0.0368, "rank": 302.0, "sources": {"floor": {"count": null, "percent": null}, "newsletters": {"count": 942, "percent": 0.0361}, "statements": {"count": 15, "percent": 0.0}, "tweets": {"count": 21, "percent": 0.0952}}, "example": {"date": "", "source": "newsletters", "text": "We also created the Select Committee on the Strategic Competition between the United States and Chinese Communist Party , which will investigate and submit policy recommendations on the status of the Chinese Communist Party's economic, technological, and security progress, and its competition with the United States. Thursday, I voted to pass HR 22 the Protecting America's Strategic Petroleum Reserve from China Act which would prevent the Secretary of Energy from selling our Strategic Petroleum Reserves to any entity affiliated with the Chinese Communist Party or any entity that intends to export it to China."}}, "legislative_discussion": {"count": 978, "percent": 0.2219, "rank": 218.0, "sources": {"floor": {"count": null, "percent": null}, "newsletters": {"count": 942, "percent": 0.2091}, "statements": {"count": 15, "percent": 0.8}, "tweets": {"count": 21, "percent": 0.381}}, "example": {"date": "", "source": "newsletters", "text": "I have and will continue to support legislation that requires the Biden Administration to provide Congress declassified intelligence reports regarding the origins of COVID-19. The VA Needs More Accountability Not Less Thursday, I voted against HR 1948 because it hamstrings the VA Secretary's ability to ensure the highest quality of care for America's veterans."}}}}